<details><summary>Digger run report at 2024-01-10 19:29:40 (UTC)</summary>
      <details><summary>Additional output for <b>diggerhq/demo-infracost-append#production</b></summary>
  
```terraform
{"version":"0.2","metadata":{"infracostCommand":"diff","vcsBranch":"ZIJ-patch-4","vcsCommitSha":"5a6992003d283a7802b77534080d9575130ff007","vcsCommitAuthorName":"Igor Zalutski","vcsCommitAuthorEmail":"izalutski@gmail.com","vcsCommitTimestamp":"2024-01-10T19:27:56Z","vcsCommitMessage":"Update digger.yml","vcsRepositoryUrl":"https://github.com/diggerhq/demo-infracost-append","vcsProvider":"github","vcsBaseBranch":"main","vcsPullRequestTitle":"Update digger.yml","vcsPullRequestUrl":"https://github.com/diggerhq/demo-infracost-append/pull/4","vcsPullRequestAuthor":"ZIJ","vcsPipelineRunId":"7479840484","vcsPullRequestId":"4"},"currency":"USD","projects":[{"name":"diggerhq/demo-infracost-append/prod","metadata":{"path":".","type":"terraform_dir","vcsSubPath":"prod","vcsCodeChanged":true,"providers":[{"name":"aws","filename":"main.tf","startLine":18,"endLine":20}]},"pastBreakdown":{"resources":[{"name":"aws_instance.vm_instance","resourceType":"aws_instance","tags":{"Name":"terraform-instance"},"metadata":{"calls":[{"blockName":"aws_instance.vm_instance","endLine":59,"filename":"main.tf","startLine":51}],"checksum":"0099841e965a76dc232c9694726cf886250fad19770b410155840d033d5ab55f","endLine":59,"filename":"main.tf","startLine":51},"hourlyCost":"0.0126958904109589","monthlyCost":"9.268","costComponents":[{"name":"Instance usage (Linux/UNIX, on-demand, t2.micro)","unit":"hours","hourlyQuantity":"1","monthlyQuantity":"730","price":"0.0116","hourlyCost":"0.0116","monthlyCost":"8.468"}],"subresources":[{"name":"root_block_device","metadata":{},"hourlyCost":"0.0010958904109589","monthlyCost":"0.8","costComponents":[{"name":"Storage (general purpose SSD, gp2)","unit":"GB","hourlyQuantity":"0.010958904109589","monthlyQuantity":"8","price":"0.1","hourlyCost":"0.0010958904109589","monthlyCost":"0.8"}]}]}],"totalHourlyCost":"0.0126958904109589","totalMonthlyCost":"9.268"},"breakdown":{"resources":[{"name":"aws_instance.vm_instance","resourceType":"aws_instance","tags":{"Name":"terraform-instance"},"metadata":{"calls":[{"blockName":"aws_instance.vm_instance","endLine":60,"filename":"main.tf","startLine":52}],"checksum":"0099841e965a76dc232c9694726cf886250fad19770b410155840d033d5ab55f","endLine":60,"filename":"main.tf","startLine":52},"hourlyCost":"0.0126958904109589","monthlyCost":"9.268","costComponents":[{"name":"Instance usage (Linux/UNIX, on-demand, t2.micro)","unit":"hours","hourlyQuantity":"1","monthlyQuantity":"730","price":"0.0116","hourlyCost":"0.0116","monthlyCost":"8.468"}],"subresources":[{"name":"root_block_device","metadata":{},"hourlyCost":"0.0010958904109589","monthlyCost":"0.8","costComponents":[{"name":"Storage (general purpose SSD, gp2)","unit":"GB","hourlyQuantity":"0.010958904109589","monthlyQuantity":"8","price":"0.1","hourlyCost":"0.0010958904109589","monthlyCost":"0.8"}]}]}],"totalHourlyCost":"0.0126958904109589","totalMonthlyCost":"9.268"},"diff":{"resources":[],"totalHourlyCost":"0","totalMonthlyCost":"0"},"summary":{"totalDetectedResources":4,"totalSupportedResources":1,"totalUnsupportedResources":0,"totalUsageBasedResources":1,"totalNoPriceResources":3,"unsupportedResourceCounts":{},"noPriceResourceCounts":{"aws_security_group":1,"aws_subnet":1,"aws_vpc":1}}}],"totalHourlyCost":"0.0126958904109589","totalMonthlyCost":"9.268","pastTotalHourlyCost":"0.0126958904109589","pastTotalMonthlyCost":"9.268","diffTotalHourlyCost":"0","diffTotalMonthlyCost":"0","timeGenerated":"2024-01-10T19:29:50.264672832Z","summary":{"totalDetectedResources":4,"totalSupportedResources":1,"totalUnsupportedResources":0,"totalUsageBasedResources":1,"totalNoPriceResources":3,"unsupportedResourceCounts":{},"noPriceResourceCounts":{"aws_security_group":1,"aws_subnet":1,"aws_vpc":1}}}

  ```
</details>

<details><summary>Plan for <b>diggerhq/demo-infracost-append#production</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_instance.vm_instance will be created
  + resource "aws_instance" "vm_instance" {
      + ami                                  = "ami-05c13eab67c5d8861"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-0cdcb150d16e8c61f",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-01c58f677b4876463"
      + tags                                 = {
          + "Name" = "terraform-instance"
        }
      + tags_all                             = {
          + "Name" = "terraform-instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (production)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>